network_basics/proj-week/20201152xxx.org
#+TITLE:    《计算机网络》实习报告
#+AUTHOR:    张三(20201152xxx)
#+EMAIL:     zhangsan@gmail.com
#+LANGUAGE:  cn
#+OPTIONS:   H:3 num:t toc:2 \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT: 

* Packet analysis
Upon running the following command:

#+begin_src sh
sudo tcpdump -ilo -nnvvvxXKS -s0 port 3333
#+end_src

the following packet is captured:

#+begin_example
08:34:10.790666 IP (tos 0x0, ttl 64, id 12824, offset 0, flags [DF], proto TCP (6),
length 64)
    127.0.0.1.46668 > 127.0.0.1.3333: Flags [P.], seq 2400005725:2400005737, ack 373279396,
    win 512, options [nop,nop,TS val 3259949783 ecr 3259896343], length 12
        0x0000:  4500 0040 3218 4000 4006 0a9e 7f00 0001  E..@2.@.@.......
        0x0010:  7f00 0001 b64c 0d05 8f0d 2e5d 163f caa4  .....L.....].?..
        0x0020:  8018 0200 fe34 0000 0101 080a c24e e2d7  .....4.......N..
        0x0030:  c24e 1217 6865 6c6c 6f20 776f 726c 640a  .N..hello.world.
#+end_example

1. Tell me the meaning of each option used in the previous command.
   - *-i*: 
   - *-nn*: 
   - *-vvv*: 
   - *-x*:
   - *-X*: 
   - *-S*: 
   - *-K*: 
   - *-s0*: 

2. Please analyze this captured packet and explain it to me as detailed as you can.     
   - Answer :: 

* HTTP
1. Write a simple script showing how HTTP works (you need =curl=);
   #+begin_src sh
     #!/bin/bash

   #+end_src

2. Record your HTTP demo session with =ttyrec=.
      
* Questions
List at least 5 problems you've met while doing this work. When listing your problems,
you have to tell me:
1. Description of this problem. For example,
   - What were you trying to do before seeing this problem?
2. How did you try solving this problem？ For example,
   - Did you google? web links?
   - Did you read the man page?
   - Did you ask others for hints?
    
** Problems
1. 
2. 
3. 
4. 
5. 

