network_basics/proj-week/20201152xxx.html
<!DOCTYPE html>
<html lang="cn">
<head>
<!-- 2021-06-11 Fri 10:21 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>《计算机网络》实习报告</title>
<meta name="generator" content="Org mode">
<meta name="author" content="张三(20201152xxx)">
<link rel="stylesheet" href="https://cs6.swfu.edu.cn/org.css" type="text/css">
</head>
<body>
<div id="content">
<h1 class="title">《计算机网络》实习报告</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org425a9b6">1. Packet analysis</a></li>
<li><a href="#orgdb74a5c">2. HTTP</a></li>
<li><a href="#org00f3c35">3. Questions</a>
<ul>
<li><a href="#org2559f4e">3.1. Problems</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org425a9b6" class="outline-2">
<h2 id="org425a9b6"><span class="section-number-2">1.</span> Packet analysis</h2>
<div class="outline-text-2" id="text-1">
<p>
Upon running the following command:
</p>

<div class="org-src-container">
<pre class="src src-sh">sudo tcpdump -ilo -nnvvvxXKS -s0 port 3333
</pre>
</div>

<p>
the following packet is captured:
</p>

<pre class="example" id="org39c18d0">
08:34:10.790666 IP (tos 0x0, ttl 64, id 12824, offset 0, flags [DF], proto TCP (6),
length 64)
    127.0.0.1.46668 &gt; 127.0.0.1.3333: Flags [P.], seq 2400005725:2400005737, ack 373279396,
    win 512, options [nop,nop,TS val 3259949783 ecr 3259896343], length 12
        0x0000:  4500 0040 3218 4000 4006 0a9e 7f00 0001  E..@2.@.@.......
        0x0010:  7f00 0001 b64c 0d05 8f0d 2e5d 163f caa4  .....L.....].?..
        0x0020:  8018 0200 fe34 0000 0101 080a c24e e2d7  .....4.......N..
        0x0030:  c24e 1217 6865 6c6c 6f20 776f 726c 640a  .N..hello.world.
</pre>

<ol class="org-ol">
<li>Tell me the meaning of each option used in the previous command.
<ul class="org-ul">
<li><b>-i</b>:</li>
<li><b>-nn</b>:</li>
<li><b>-vvv</b>:</li>
<li><b>-x</b>:</li>
<li><b>-X</b>:</li>
<li><b>-S</b>:</li>
<li><b>-K</b>:</li>
<li><b>-s0</b>:</li>
</ul></li>

<li>Please analyze this captured packet and explain it to me as detailed as you can.     
<dl class="org-dl">
<dt>Answer</dt><dd></dd>
</dl></li>
</ol>
</div>
</div>

<div id="outline-container-orgdb74a5c" class="outline-2">
<h2 id="orgdb74a5c"><span class="section-number-2">2.</span> HTTP</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li><p>
Write a simple script showing how HTTP works (you need <code>curl</code>);
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b0bec5;">#</span><span style="color: #b0bec5;">!/bin/</span><span style="color: #fff59d;">bash</span>

</pre>
</div></li>

<li>Record your HTTP demo session with <code>ttyrec</code>.</li>
</ol>
</div>
</div>

<div id="outline-container-org00f3c35" class="outline-2">
<h2 id="org00f3c35"><span class="section-number-2">3.</span> Questions</h2>
<div class="outline-text-2" id="text-3">
<p>
List at least 5 problems you've met while doing this work. When listing your problems,
you have to tell me:
</p>
<ol class="org-ol">
<li>Description of this problem. For example,
<ul class="org-ul">
<li>What were you trying to do before seeing this problem?</li>
</ul></li>
<li>How did you try solving this problem？ For example,
<ul class="org-ul">
<li>Did you google? web links?</li>
<li>Did you read the man page?</li>
<li>Did you ask others for hints?</li>
</ul></li>
</ol>
</div>

<div id="outline-container-org2559f4e" class="outline-3">
<h3 id="org2559f4e"><span class="section-number-3">3.1.</span> Problems</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 张三(20201152xxx)</p>
<p class="date">Created: 2021-06-11 Fri 10:21</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
